## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization  | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

_**Hint:** If "Terraform Format & Style" failed, run `terraform fmt -recursive` from the `terraform/` directory and commit the results._

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-   destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_ecs_service.console will be updated in-place
  ~ resource "aws_ecs_service" "console" {
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/cpfreporter/cpfreporter-console"
        name                               = "cpfreporter-console"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:27" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.console must be replaced
+/- resource "aws_ecs_task_definition" "console" {
      ~ arn                      = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:27" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "cpfreporter-console" -> (known after apply)
      ~ revision                 = 27 -> (known after apply)
-       tags                     = {} -> null
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_s3_object.lambda_artifact-graphql must be replaced
+/- resource "aws_s3_object" "lambda_artifact-graphql" {
+       acl                    = (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "00bc4cd9ef7d908e382f47c1206f76c4-6" -> "fa9185f5c4afa2c3ab5c8e584bda4f38"
      ~ id                     = "graphql.dc448572876ddfd7912a8c6203fa928e.zip" -> (known after apply)
      ~ key                    = "graphql.dc448572876ddfd7912a8c6203fa928e.zip" -> "graphql.fa9185f5c4afa2c3ab5c8e584bda4f38.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source_hash            = "dc448572876ddfd7912a8c6203fa928e" -> "fa9185f5c4afa2c3ab5c8e584bda4f38"
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "fvDKt8lBh5ixPvGUVCPfLI33QW106xdz" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["200.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "a8af18f2ff56b06c11fa1727d9a20536" -> "78c4b7274c0ceda4fe574d6c1455b70c"
        id                     = "dist/200.html"
      ~ source_hash            = "a8af18f2ff56b06c11fa1727d9a20536" -> "78c4b7274c0ceda4fe574d6c1455b70c"
        tags                   = {}
      ~ version_id             = "TdDJoX9zvgv_OdoFU6z_b22TXyjAJ8C1" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["build-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "5fc5387a89f304e1313f6a034aa2f182" -> "60460f123791d16f1076e134263a5e8b"
        id                     = "dist/build-manifest.json"
      ~ source_hash            = "5fc5387a89f304e1313f6a034aa2f182" -> "60460f123791d16f1076e134263a5e8b"
        tags                   = {}
      ~ version_id             = "irlnf9L5bLEnz6sqxkizGAAYgCkYHV.0" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["chunk-references.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "24500fad75e9089591b4d4a1b3e5984b" -> "b43733441398b62568277c46021337de"
        id                     = "dist/chunk-references.json"
      ~ source_hash            = "24500fad75e9089591b4d4a1b3e5984b" -> "b43733441398b62568277c46021337de"
        tags                   = {}
      ~ version_id             = "h903Qj.Nq_NGRQB5xSK6vjuf6RKJyaYY" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "a8af18f2ff56b06c11fa1727d9a20536" -> "78c4b7274c0ceda4fe574d6c1455b70c"
        id                     = "dist/index.html"
      ~ source_hash            = "a8af18f2ff56b06c11fa1727d9a20536" -> "78c4b7274c0ceda4fe574d6c1455b70c"
        tags                   = {}
      ~ version_id             = "oozzt6_kLzsn_JOhwhxfKhOQhCRkhQnq" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/163.c2ae643e.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "f26b70640dedc8dbc4d2e44e83b36fce"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/163.c2ae643e.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/163.c2ae643e.chunk.js"
+       source_hash            = "f26b70640dedc8dbc4d2e44e83b36fce"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/163.c2ae643e.chunk.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "d6f288673ebf3a5c2244ef822078fc27"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/163.c2ae643e.chunk.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/163.c2ae643e.chunk.js.LICENSE.txt"
+       source_hash            = "d6f288673ebf3a5c2244ef822078fc27"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/99.aed1dd23.chunk.js"] will be destroyed
  # (because key ["static/js/99.aed1dd23.chunk.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "69b92d685e531f990f4afd0cd2418908" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/99.aed1dd23.chunk.js" -> null
-       key                    = "dist/static/js/99.aed1dd23.chunk.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/99.aed1dd23.chunk.js" -> null
-       source_hash            = "69b92d685e531f990f4afd0cd2418908" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "ARLcvmL7PEyGcTrNdUZgkCa6PAutxLS2" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/99.aed1dd23.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/99.aed1dd23.chunk.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "d07b2d386f8665764f69e113088257af" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/99.aed1dd23.chunk.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/99.aed1dd23.chunk.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/99.aed1dd23.chunk.js.LICENSE.txt" -> null
-       source_hash            = "d07b2d386f8665764f69e113088257af" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "rFEGVtMjMgIZcjo48EqiZ4XEzvG3UShI" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadEditUploadPage.7014aec3.chunk.js"] will be destroyed
  # (because key ["static/js/UploadEditUploadPage.7014aec3.chunk.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "88a13ab6ee91b402cef0139fd0197183" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/UploadEditUploadPage.7014aec3.chunk.js" -> null
-       key                    = "dist/static/js/UploadEditUploadPage.7014aec3.chunk.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadEditUploadPage.7014aec3.chunk.js" -> null
-       source_hash            = "88a13ab6ee91b402cef0139fd0197183" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "YJVusUrHQDL_AcOQ1XtboNbiC9r.eMA_" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadEditUploadPage.7014aec3.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/UploadEditUploadPage.7014aec3.chunk.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "96f9138b4e14af18a824fab3e9e23c9f" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/UploadEditUploadPage.7014aec3.chunk.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/UploadEditUploadPage.7014aec3.chunk.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadEditUploadPage.7014aec3.chunk.js.LICENSE.txt" -> null
-       source_hash            = "96f9138b4e14af18a824fab3e9e23c9f" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "E4HaqO8tMcXoAnB1ySGH9l9dD1rCKtBx" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadEditUploadPage.89a256ac.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "a05539fb2671d96a74012d2cf045f29f"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/UploadEditUploadPage.89a256ac.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadEditUploadPage.89a256ac.chunk.js"
+       source_hash            = "a05539fb2671d96a74012d2cf045f29f"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadEditUploadPage.89a256ac.chunk.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "27a5f7584a3a992250b7df0de6d4c1a1"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/UploadEditUploadPage.89a256ac.chunk.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadEditUploadPage.89a256ac.chunk.js.LICENSE.txt"
+       source_hash            = "27a5f7584a3a992250b7df0de6d4c1a1"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadNewUploadPage.7da969bd.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "78e5e5ccb29ad7391880873c09b406d8"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/UploadNewUploadPage.7da969bd.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadNewUploadPage.7da969bd.chunk.js"
+       source_hash            = "78e5e5ccb29ad7391880873c09b406d8"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadNewUploadPage.7da969bd.chunk.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "cc27fa172211f2877b50629ac7228a71"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/UploadNewUploadPage.7da969bd.chunk.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadNewUploadPage.7da969bd.chunk.js.LICENSE.txt"
+       source_hash            = "cc27fa172211f2877b50629ac7228a71"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadNewUploadPage.cc12cba5.chunk.js"] will be destroyed
  # (because key ["static/js/UploadNewUploadPage.cc12cba5.chunk.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "9f0b09632a5947e9f0d2e1b9b7bd552d" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/UploadNewUploadPage.cc12cba5.chunk.js" -> null
-       key                    = "dist/static/js/UploadNewUploadPage.cc12cba5.chunk.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadNewUploadPage.cc12cba5.chunk.js" -> null
-       source_hash            = "9f0b09632a5947e9f0d2e1b9b7bd552d" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "lLKQEnbXqozLYEygyQg78G8q6JuXA37r" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadNewUploadPage.cc12cba5.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/UploadNewUploadPage.cc12cba5.chunk.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "e85a6c8f4bd5b4466b87ca45f9af1e92" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/UploadNewUploadPage.cc12cba5.chunk.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/UploadNewUploadPage.cc12cba5.chunk.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadNewUploadPage.cc12cba5.chunk.js.LICENSE.txt" -> null
-       source_hash            = "e85a6c8f4bd5b4466b87ca45f9af1e92" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "Jyu0GcEkKvNiszKwRmbcy4zBkzRz5t_D" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.545a8692.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "617a3b98ba25afb3b1913333db0f148e"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.545a8692.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.545a8692.js"
+       source_hash            = "617a3b98ba25afb3b1913333db0f148e"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.545a8692.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "9ca7566c06c8f1334eac82d09ba421ad"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.545a8692.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.545a8692.js.LICENSE.txt"
+       source_hash            = "9ca7566c06c8f1334eac82d09ba421ad"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.7d3866da.js"] will be destroyed
  # (because key ["static/js/app.7d3866da.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "39bfbe991d0665d6af8084bff5d38134" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.7d3866da.js" -> null
-       key                    = "dist/static/js/app.7d3866da.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.7d3866da.js" -> null
-       source_hash            = "39bfbe991d0665d6af8084bff5d38134" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "0NGCvp.zpBaTmYXIwCrqXyYVk1OiGr7V" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.7d3866da.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/app.7d3866da.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "22534f5b586cb736e9cdf4c0742c3fd1" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.7d3866da.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/app.7d3866da.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.7d3866da.js.LICENSE.txt" -> null
-       source_hash            = "22534f5b586cb736e9cdf4c0742c3fd1" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "UcIxB5.tyIyXnli4AJoN3dW2pkId_StW" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/runtime-app.2c819207.js"] will be destroyed
  # (because key ["static/js/runtime-app.2c819207.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "b15d7caba841d187868cf52eba1e24e9" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/runtime-app.2c819207.js" -> null
-       key                    = "dist/static/js/runtime-app.2c819207.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/runtime-app.2c819207.js" -> null
-       source_hash            = "b15d7caba841d187868cf52eba1e24e9" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "7BnUu63r8s93MVKyq48xOSgyKwLwSeVy" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/runtime-app.95e9f28c.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "75ce1a24a28a49e58a4040d896de1f58"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/runtime-app.95e9f28c.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/runtime-app.95e9f28c.js"
+       source_hash            = "75ce1a24a28a49e58a4040d896de1f58"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # module.lambda_function-graphql.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-graphql"
      ~ last_modified                  = "2023-12-23T23:55:56.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:43" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:43/invocations" -> (known after apply)
      ~ s3_key                         = "graphql.dc448572876ddfd7912a8c6203fa928e.zip" -> "graphql.fa9185f5c4afa2c3ab5c8e584bda4f38.zip"
        tags                           = {}
      ~ version                        = "43" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                      = "1927dbe1b2c80f801880ae9aa0fd18cd61aa4195" -> "15783448ca2cbd6ca621143876a0806818088ff5"
              ~ "DD_TAGS"                            = "git.commit.sha:1927dbe1b2c80f801880ae9aa0fd18cd61aa4195,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:15783448ca2cbd6ca621143876a0806818088ff5,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                         = "1927dbe1b2c80f801880ae9aa0fd18cd61aa4195" -> "15783448ca2cbd6ca621143876a0806818088ff5"
                # (15 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.lambda_function-graphql.aws_lambda_permission.current_version_triggers["APIGateway"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "APIGateway" -> (known after apply)
      ~ qualifier           = "43" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 12 to add, 6 to change, 12 to destroy.
```

</details>

*Pusher: @dysmento, Action: `pull_request_target`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/cpf-reporter/actions/runs/7399797469)*